# ------------------------------------ How to use ------------------------------------
# 1. 파이썬 인터프리터를 vsc에서 사용하려면,

# Ctrl + Shift + p를 누르고, 'start repl' 을 검색합니다.

# 터미널에 입력을 받을 수 있는 창이 뜹니다.

# 파이썬 코드를 작성합니다.



# 2. 디버그 모드를 사용하려면,

# 왼쪽에 디버그 모양 아이콘을 선택합니다.

# create launch.json을 누르면 파일이 실행되는데 그냥 저장하고 끕니다.

# F9로 break pointer를 지정하고

# F5로 디버깅을 시작합니다.

# F11로 다음 줄로 이동할 수 있습니다.

# Shift + F2로 escape할 수 있습니다. 



# 3. 빌드를 하려면,

# 해당 소스코드 창에서 오른쪽 마우스 -> Run Python File in terninal을 누르면 실행됩니다.

# ------------------------------------------------------------------------------------
print('hello world')
print('hello world')
print('hello world')